      ***************  controle GEracao INcompleta **********

           SELECT CBGEIN ASSIGN TO DISK
                  ORGANIZATION  IS RELATIVE
                  ACCESS MODE   IS RANDOM
                  RELATIVE KEY  IS RK-CBGEIN
                  LOCK MODE     IS EXCLUSIVE
                  FILE STATUS   IS FS-CBGEIN.

