
      *******************************************************************
      *                   Parametros da empresa                         *
      *******************************************************************

       FD  CBPAEM
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS LB-CBPAEM.

       01  CBPAEM-REG.
           05 CBPAEM-TESTE-PAGINA     PIC  9(001).
           05                         PIC  X(049).

