
      *******************************************************************
      *               Valores de determinada moeda                      *
      *******************************************************************

           SELECT CBTAMD ASSIGN TO DISK
                  ORGANIZATION  IS INDEXED
                  ACCESS MODE   IS DYNAMIC
                  LOCK MODE     IS EXCLUSIVE
                  RECORD  KEY   IS CBTAMD-CHAVE
                  FILE STATUS   IS FS-CBTAMD.

