
      *******************************************************************
      *               Texto de abertura                                 *
      *******************************************************************

           SELECT CBTEAF ASSIGN TO DISK
                  ORGANIZATION  IS LINE SEQUENTIAL
                  LOCK MODE     IS MANUAL
                  FILE STATUS   IS FS-CBTEAF.

